name: "ArfacesExpression"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  image_data_param {
    source: "arfaces-expression-data.1.txt"
    batch_size: 4
	new_height : 224
	new_width : 224
  }
}
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  image_data_param {
    source: "arfaces-expression-data.2.txt"
    batch_size: 4
	new_height : 224
	new_width : 224
  }
}
layers {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: CONVOLUTION
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: RELU
}
layers {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: CONVOLUTION
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: RELU
}
layers {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: CONVOLUTION
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1 
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: RELU
}
layers {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: CONVOLUTION
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1 
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: RELU
}
layers {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: RELU
}
layers {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: RELU
}
layers {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: RELU
}
layers {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: RELU
}
layers {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: RELU
}
layers {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: RELU
}
layers {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: RELU
}
layers {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: RELU
}
layers {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  blobs_lr: 0.1  
  weight_decay: 1
  blobs_lr: 0.2 
  weight_decay: 1
}
layers {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: RELU
}
layers {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
#layers {
#  bottom: "pool5"
#  top: "fc6"
#  name: "fc6"
#  type: INNER_PRODUCT
#  inner_product_param {
#    num_output: 4096
#  }
#  blobs_lr: 0.00001  
#  weight_decay: 1
#  blobs_lr: 0.00002 
#  weight_decay: 1
#}
#layers {
#  bottom: "fc6"
#  top: "fc6"
#  name: "relu6"
#  type: RELU
#}
#layers {
#  bottom: "fc6"
#  top: "fc6"
#  name: "drop6"
#  type: DROPOUT
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
#layers {
#  bottom: "fc6"
#  top: "fc7"
#  name: "fc7"
#  type: INNER_PRODUCT
#  inner_product_param {
#    num_output: 4096
#  }
#  blobs_lr: 0.00001  
#  weight_decay: 1
#  blobs_lr: 0.00002 
#  weight_decay: 1
#}
#layers {
#  bottom: "fc7"
#  top: "fc7"
#  name: "relu7"
#  type: RELU
#}
#layers {
#  bottom: "fc7"
#  top: "fc7"
#  name: "drop7"
#  type: DROPOUT
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
layers {
  bottom: "pool5"
  top: "fc_arf1"
  name: "fc_arf1"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 128
      weight_filler {
      type: "xavier"
    } 
  }
  blobs_lr: 1.0  
  weight_decay: 1
  blobs_lr: 2.0
  weight_decay: 1
}
layers {
  bottom: "fc_arf1"
  top: "fc_arf1"
  name: "relu_arf1"
  type: RELU
}
layers {
  bottom: "fc_arf1"
  top: "fc_arf2"
  name: "fc_arf2"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "xavier"
    }
  }
  blobs_lr: 1.0  
  weight_decay: 1
  blobs_lr: 2.0
  weight_decay: 1
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "fc_arf2"
  bottom: "label"
  top: "accuracy"
}
layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "fc_arf2"
  bottom: "label"
  top: "loss"
  include {
    phase: TRAIN
  }
}
